/*

    array ເປັນ ລິດຂໍ້ມູນ ຫຼື ຊຸດຂໍ້ມູນ ທີມີລຳດັບ Index ທີ່ສາມາດເຂົ້າເຖິງໄດ້ ຕັ້ງແຕ່ 0 ຂື້ນໄປ
    ເຮົາຈະໃຊ້ໃນເວລາເກັບຄ່າຫຼາຍຄ່າໃນຕົວແປດຽວ ເຊັ່ນ ລາຍຊື່,ສິນຄ້າ, ຄະແນນ ເປັນຕົ້ນ  
    
*/

let fruits = ["Mango","Apple","Banana"];
console.log(fruits[1]);

/* 

ເຮົາຈະໃຊ້ array ກໍຕໍ່ເມື່ອ :
    1. ລະບົບເກັບລາຍຊື່ (User,Customer) ເຊັ່ນ ໃຊ້ເວລາຕ້ອງເກັບຫຼາຍໆ ຊື່ຜູ້ໃຊ້ ເຊັ່ນໃນ CRM ຫຼື ລະບົບສະມັກສະມາຊິກ
    2. ຕະກ້າສິນຄ້າ (Shipping Cart) 👉 ໃຊ້ເກັບລາຍການສິນຄ້າທີ່ລູກຄ້າເລືອກຊື້
    3. ການຈັດເກັບຂໍ້ມູນເຊີງລິສ ເຊັ່ນ ລິສພະນັກງານ, ລິສອໍເດີ, ລິສເມນູ
    4. ການປະມວນຜົນຂໍ້ມູນຈຳນວນຫຼາຍ ເຊັ່ນ ຄະແນນສອບ, ຍອດຂາຍຮາຍວັນ 👉 ໃຊ້ເຮັດສະຖິຕິ, ກຮາຟ, dashboard
    5. API Response (ຮັບຂໍ້ມູນຈາກ Backend) ເວລາເຈົ້າຍິງ API ເຊັ່ນການຂໍຂໍ້ມູນສິນຄ້າທັ້ງໝົດ ມັກໄດ້ເປັນ array ຂອງ object 👉 ໃຊ້ loop ເພື່ອສະແດງສິນຄ້າໃນໜ້າເວັບ

*/

let customers = ["Jo", "Top", "Toon"]; // ໃຊ້ເວລາຕ້ອງເກັບຫຼາຍໆ ຊື່ຜູ້ໃຊ້ ເຊັ່ນໃນ CRM ຫຼື ລະບົບສະມັກສະມາຊິກ
console.log(customers[0]);

let cart = ["Laptop", "PC","Macbook"]; // 👉 ໃຊ້ເກັບລາຍການສິນຄ້າທີ່ລູກຄ້າເລືອກຊື້
console.log(cart[2]);

let orders = [123,124,125]; // ການຈັດເກັບຂໍ້ມູນເຊີງລິສ ເຊັ່ນ ລິສພະນັກງານ, ລິສອໍເດີ, ລິສເມນູ
console.log(orders);

let sales = [500,660,700,800,900]; // ການປະມວນຜົນຂໍ້ມູນຈຳນວນຫຼາຍ ເຊັ່ນ ຄະແນນສອບ, ຍອດຂາຍຮາຍວັນ 👉 ໃຊ້ເຮັດສະຖິຕິ, ກຮາຟ, dashboard
console.log(sales);

let product = [
    {id:1, name: "PC", price: 50000},
    {id:2, name: "Macbook", price: 150000},
    {id:3, name: "IPhone", price: 45000},
]; // API Response (ຮັບຂໍ້ມູນຈາກ Backend) ເວລາເຈົ້າຍິງ API ເຊັ່ນການຂໍຂໍ້ມູນສິນຄ້າທັ້ງໝົດ ມັກໄດ້ເປັນ array ຂອງ object 👉 ໃຊ້ loop ເພື່ອສະແດງສິນຄ້າໃນໜ້າເວັບ

