/* 

null ແມ່ນຄ່າທີ່ຕັ້ງໃຈເຮັດໃຫ້ເປັນຄ່າວ່າງປ່າວທີ່ກຳນົດຄ່າແລ້ວ ເຊັ່ນ : ປະກາດຕົວແປມາຕົວໜື່ງ ແລ້ວເຮັດໃຫ້ value = null ແລະ ຫຼັງຈາກນັ້ນ ຖ້າໃຫ້ຜູ້ໃຊ້ປ້ອນຂໍ້ມູນເຂົ້າ
ຈະເຮັດໃຫ້ທີ່ເກັບນີ້ສາມາດໃຊ້ງານເລີຍທັນທີ

    ແລະເຮົາຈະໄດ້ໃຊ້ເມື່ອ :
    1. ລະບົບສະມັກສະມາຊິກ ຖ້າຜູ້ໃຊ້ສະມັກສະມາຊິກມາໃໝ່ ແຕ່ຍັງບໍ່ໄດ້ໃສ່ຂໍ້ມູນ ເບີໂທ  ເຮົາຈະເກັບຂໍ້ມູນແບບ phone = null; ໄວ້ກ່ອນເພື່ອໃຫ້ສາມາດກຮອກໃນພາຍຫຼັງໄດ້
    2. ລະບົບ Ecommerce ຊ່ອງທາງການຈັດສົ່ງ ຍັງບໍ່ຖືກເລືອກຂໍ້ມູນໃສ່ຕອນແລກ shippingMethod = null;
    3. CRM (Customer Relationship Management) ການຕິດຕໍ່ຄັ້ງຕໍ່ໄປຍັງບໍ່ໄດ້ລະບຸວັນທີ່
    4. ຈັດການແຕ້ມສະສົມຄູປອງທີ່ບໍ່ທັນໄດ້ໃຊ້
    5. ລະບົບທະນາຄານ ຍັງບໍ່ທັນຜູກບັນຊີບັດເຄດິດ

    ມາເບິ່ງຕົວຢ່າງການຂຽນນຳກັນ :
*/

let user = {

    name:"Phasouk",
    email:"rouangchalern.phasouk11@gmail.com",
    phone: null
}

console.log(user);


let order = {
  items: ["Book", "Pen"],
  couponCode: null
};

let account = {
  accountNumber: "123-456",
  linkedCard: null  
};