/*  

undefined ແມ່ນຄ່າ default ທີ່ເຮົາຂຽນຂື້ນມາ ຖືກປະກາດຂື້ນແຕ່ຍັງບໍ່ໄດ້ກຳຫນົດຄ່າດ້ານໃນເອົາໄວ້ 
undefined = ຍັງບໍ່ຖືກກຳນົດຄ່າ (system ໃສ່ໃຫ້ເອງ)
null = ຖືກກຳນົດຄ່າໄວ້ ແຕ່ເຮົາຕັ້ງໃຈເຮັດໃຫ້ມັນວ່າງ  

        undefined = ຟິລທີ່ຕ້ອງການໃຫ້ກຮອກຂໍ້ມູນຈຳເປັນໃຫ້ຄົນ ເຊັ່ນ : ຊື່, ນາມສະກຸນ, ອີເມລ, ເບີໂທ ອິຫຍັງປະມານນີ້
        null = ຟິລທີ່ໃສ່ສຳລັບໃຫ້ຜູ້ໃຊ້ອັບເດດຂໍ້ມູນເສີມພາຍຫຼັງໄດ້ ເຊັ່ນ ຊື່ຫຼິ້ນ, ທີ່ຢູ່ 
*/

// ເຮົາຈະໃຊ້ມັນຕອນໃດ ໄປເບິ່ງຕົວຢ່າງພ້ອມກັນ :

/*   

    1. ລະບົບຟອມກອກຂໍ້ມູນ
    2. API Reponse ຖ້າ Server ບໍ່ສົ່ງ field ກັບມາຄ່າຈະເປັນ undefined ຝັ່ງ client

*/


let user = {
  username: undefined,   // ❌ ຕ້ອງກອກຂໍ້ມູນທັນທີ
  password: undefined,   // ❌ ຕ້ອງກອກຂໍ້ມູນທັນທີ
  email: undefined,      // ❌ ຕ້ອງກອກຂໍ້ມູນທັນທີ
  phone: null,           // ✅ ຈະໃສ່ຕອນນີ້ ຫຼື ຕາມຫຼັງກະໄດ້ບໍ່ບັງຄັບ
  nickname: null         // ✅ ຈະໃສ່ຕອນນີ້ ຫຼື ຕາມຫຼັງກະໄດ້ບໍ່ບັງຄັບ
};


// ຕົວຢ່າງອື່ນໆທີ່ໃຊ້ ສຳລັບ null :  1. ໃຊ້ໃນລະບົບ ERM ຫຼື ສະມັກສະມາຊິກທີ່ຜູ້ໃຊ້ຈະໃຫ້ຂໍ້ມູນບາງຢ່າງຕາມຫຼັງໄດ້
let customer = {
    name: "John",
    email: null  // ຍັງບໍ່ໄດ້ໃສ່ອີເມລ ແຕ່ຈະໃສ່ທີ່ຫຼັງ
};

// ການລົບຄ່າ reset ຄ່າ
let sessionToken = "abcd1234";
// ເມື່ອຜູ້ໃຊ້ຕ້ອງການອອກຈາກລະບົບ
sessionToken = null;  


/*

ຕົວຢ່າງອື່ນໆທີ່ໃຊ້ ສຳລັບ undefined : 
    1. ຕົວແປທີ່ຍັງບໍ່ໄດ້ກຳນົດຄ່າ = 👉 ໃຊ້ກວດສອບວ່າຜູ້ໃຊ້ໃສ່ໂຄ້ດສ່ວນລົດນີ້ຫຼືຍັງ
    2. ຟັງຊັນທີ່ບໍ່ຕ້ອງການໃຫ້ມີການ return ຄ່າ = 👉 ໃຊ້ດຸໃນລະບົບທີ່ບາງຟັງຊັນເຮັດວຽກຢ່າງດຽວບໍ່ຕ້ອງການຄືນຄ່າ
    3. object property ທີ່ຍັງບໍ່ມີຄ່າ = 👉 ໃຊ້ກວດສອບວ່າຜູ້ໃຊ້ເລືອກສິນຄ້າແລ້ວຫຼືຍັງ ຖ້າຍັງຈະທຳການໃຫ້ລູກຄ້າໂປຮດເລືອກສິນຄ້າກ່ອນ ຫຼື ລະບຸຈຳນວນກ່ອນໄປໜ້າຖັດໄປ

*/