console.log (5 == "5"); // ຕົວດຳເນີນການນີ້ຈະຖືກ ເພາະ double equal ຈະບໍ່ສົນວ່າຄ່າທີ່ໄດ້ມາຈະ ມີ type ຕົງກັນບໍຂໍແຕ່ ຄ່າເທົ່າກັນກໍພໍ
console.log(5 === "5"); // triple equal ຈະສົນໃຈຄ່າທີ່ຕ້ອງເທົ່າກັນ ແລະ ຊະນິດຂໍ້ມູນຈຳເປັນຕ້ອງຄືກັນອີກດ້ວຍຄ່າມັນຈື່ງຈະຖືກ
console.log(5 > 6);
console.log(5 < 6);
console.log(5 >= 5);
console.log(51 <= 7);
console.log(55 != "55"); // not equal ແມ່ນຕົວດຳເນີນການທີ່ຖ້າຄ່າເຂົ້າມາຕ່າງກັນ ຜົນລັບຈະຖືກ
console.log(55 !== "55"); // not  double equal ແມ່ນຕົວດຳເນີນການທີ່ຖ້າຄ່າເທົ່າກັນແຕ່ ຊະນິດຂໍ້ມູນຕ່າງກັນ ຜົນລັບຈະຖືກ
console.log(55 !== 55); // not e double qual ແມ່ນຕົວດຳເນີນການທີ່ຖ້າຄ່າເຂົ້າມາຄືກັນ ຜົນລັບຈະຜິດ
console.log(55 != 55); // ຜິດເພາະໄດ້ຄ່າມາເທົ່າກັນ ແຕ່ຕົວດຳເນີນການ ປະຕິເສດຄ່າເທົ່າ